Amiya200/stm32_water_tank/Core/Src/model_handle.c
void ModelHandle_StopAllModesAndMotor(void)
{
    clear_all_modes();
    stop_motor();
    ModelHandle_SaveModeState();
}
void ModelHandle_FactoryReset(void)
{
    sys.gap_time_s  = 0;
    sys.retry_count = 0;
    sys.uv_limit    = 190;
    sys.ov_limit    = 270;
    sys.overload    = 0.0f;
    sys.underload   = 0.0f;
    sys.maxrun_min  = 300;
    ModelHandle_SaveSettingsToEEPROM();
}
void ModelHandle_StartTimerNearestSlot(void)
{
    ModelHandle_ProcessTimerSlots();
}

static inline void Buzzer_SetPin(bool on)
{
//    HAL_GPIO_WritePin(LED5_GPIO_Port, LED5_Pin,
//                      on ? GPIO_PIN_SET : GPIO_PIN_RESET);
}
static void Buzzer_TriggerAlert(void)
{
    buzzerAlertUntil = HAL_GetTick() + 30000UL;  // 30 sec
}

static void Buzzer_Update(void)
{
    uint32_t now = HAL_GetTick();
    static bool buzzerState = false;
    bool newState = false;

    bool motorOn = Motor_GetStatus();

    /* ================= PUMP ON SOUND ================= */
    if (buzzerSettings.pumpOnSound && motorOn)
    {
        newState = true;  // continuous ON
    }

    /* ================= TANK FULL ================= */
    if (buzzerSettings.tankFullSound &&
        isTankFull() &&
        (now < buzzerAlertUntil))
    {
        newState = true;  // continuous long beep
    }

    /* ================= TANK EMPTY ================= */
    if (buzzerSettings.tankEmptySound &&
        get_tank_level_percent() == 0 &&
        (now < buzzerAlertUntil))
    {
        newState = ((now % 400UL) < 100UL);  // short beep pattern
    }

    if (newState != buzzerState)
    {
        buzzerState = newState;
        Buzzer_SetPin(buzzerState);
    }
}

static inline uint32_t now_ms(void)
{
    return HAL_GetTick();
}
static inline void clear_all_modes(void)
{
    manualActive    = false;
    semiAutoActive  = false;
    countdownActive = false;
    twistActive     = false;
    timerActive     = false;
    autoActive      = false;
    manualOverride  = false;
    countdownMode   = false;
}


static uint32_t motorOnStartMs = 0;
static uint32_t powerOnMs     = 0;

void ModelHandle_OnPowerUp(void)
{
    powerOnMs = HAL_GetTick();
    bootBlockUntil = powerOnMs + 5000UL;
    autoDeadline = 0;      // ✅ RESET DEADLINE
}


static inline bool Motor_IsRelayOn(void)
{
    return HAL_GPIO_ReadPin(Relay1_GPIO_Port, Relay1_Pin) == GPIO_PIN_SET;
}
static bool Motor_StartAllowed(void)
{
    return true;   // TEMP: allow immediate start
}

bool ModelHandle_IsRestartActive(void)
{
    return restartActive;
}

static inline void motor_apply(bool on)
{
	if (timerActive && timerState == TIMER_STATE_OFF)
	        on = false;
    bool relayNow = Motor_IsRelayOn();
    if (on)
    {
        if (!Motor_StartAllowed())
            return;

        if (!relayNow)
        {
            Relay_Set(1, true);
            motorOnStartMs = HAL_GetTick();
        }
        motorStatus = 1;
    }
    else
    {
        if (relayNow)
            Relay_Set(1, false);
        motorStatus = 0;
    }

    UART_SendStatusPacket();
}
bool Motor_GetStatus(void)
{
    return Motor_IsRelayOn();
}
static inline void start_motor(void)
{
	if (!restartActive &&
	    timerActive &&
	    timerState == TIMER_STATE_OFF)
	    return;
    if (motorOwner == MOTOR_OWNER_NONE)
        return;

    motor_apply(true);
}

static inline void stop_motor(void)
{
    motor_apply(false);
}
static void check_max_run(void)
{
    if (sys.maxrun_min == 0 || !Motor_GetStatus())
        return;

    if (countdownActive)
        return;
    if (restartActive)
        ;  // allow maxrun protection to work

    uint32_t limit = (uint32_t)sys.maxrun_min * 60000UL;
    if ((HAL_GetTick() - motorOnStartMs) >= limit)
    {
        senseMaxRunReached = true;
        clear_all_modes();
        stop_motor();
        ModelHandle_SaveModeState();
        Buzzer_TriggerAlert();
    }
}
void ModelHandle_CheckDryRun(void)
{
    if (manualActive || semiAutoActive || countdownActive)
    {
        senseDryRun = false;
        return;
    }
    float v = adcData.voltages[5];
    if (v < 0.01f)
        senseDryRun = true;
    else
        senseDryRun = false;
}
void ModelHandle_CheckGroundWater(void)
{
    float v = adcData.voltages[4];
    if (v < 0.01f)
        groundWater = true;
    else
        groundWater = false;
}
static inline bool isAnyModeActive(void)
{
    return (manualActive || semiAutoActive || countdownActive ||
            twistActive || timerActive || autoActive);
}
void ModelHandle_SoftDryRunHandler(void)
{
    if (countdownActive)
    {
        dryState = DRY_IDLE;
        return;
    }
    if (sys.gap_time_s == 0)
    {
        dryState = DRY_IDLE;
        return;
    }

    if (motorOwner != MOTOR_OWNER_AUTO &&
        motorOwner != MOTOR_OWNER_TIMER)
    {
        dryState = DRY_IDLE;
        return;
    }

    uint32_t now   = HAL_GetTick();
    uint32_t gapMs = (uint32_t)sys.gap_time_s * 1000UL;

    ModelHandle_CheckDryRun();
    bool motorOn = Motor_GetStatus();

    /* ================= MOTOR RUNNING ================= */
    if (motorOn)
    {
        /* ✅ WATER PRESENT */
        if (senseDryRun == true)
        {
            dryState = DRY_IDLE;
            return;
        }

        /* ❌ DRY CONDITION → Start waiting */
        if (dryState != DRY_WAITING)
        {
            dryState = DRY_WAITING;
            dryDeadline = now + gapMs;
        }

        /* Timeout reached → Stop motor */
        if ((int32_t)(now - dryDeadline) >= 0)
        {
            stop_motor();
            dryState = DRY_FAULT;
            Buzzer_TriggerAlert();
        }
    }
    else
    {
        /* Motor OFF → Reset if water comes back */
        if (dryState == DRY_FAULT && senseDryRun == true)
        {
            dryState = DRY_IDLE;
        }
    }
}

static inline uint32_t get_load_lock_duration_ms(void)
{
    if (sys.retry_count == 0)
        return LOAD_LOCK_DEFAULT_MS;
    return (uint32_t)sys.retry_count * 60000UL;
}

void ModelHandle_CheckLoadFault(void)
{
	if (!Motor_GetStatus())
        return;

    float I = g_currentA;
    float V = g_voltageV;

    bool overload  = (sys.overload  > 0.1f)   && (I > sys.overload);
    bool underload = (sys.underload > 0.001f) && (I < sys.underload);
    bool voltFault = ((sys.uv_limit && V < sys.uv_limit) ||
                      (sys.ov_limit && V > sys.ov_limit));

    senseOverLoad      = overload;
    senseUnderLoad     = underload;
    senseOverUnderVolt = voltFault;

    bool fault = overload || underload || voltFault;
    uint32_t now = HAL_GetTick();

    uint32_t lockMs = get_load_lock_duration_ms();

