Amiya200/stm32_water_tank/Core/Src/model_handle.c
    switch (loadState)
    {
        case LOAD_NORMAL:
            loadRetryCount = 0;
            if (fault)
            {
                loadState = LOAD_FAULT_WAIT;
                loadTimer = now;
            }
            break;

        case LOAD_FAULT_WAIT:
            if (!fault)
            {
                loadState = LOAD_NORMAL;
            }
            else if ((now - loadTimer) >= LOAD_FAULT_CONFIRM_MS)
            {
                stop_motor();
                loadState = LOAD_FAULT_LOCK;
                loadTimer = now;
                Buzzer_TriggerAlert();
            }
            break;

        case LOAD_FAULT_LOCK:
            if (!fault)
            {
                loadState = LOAD_NORMAL;
            }
            else if ((now - loadTimer) >= lockMs && loadRetryCount < 1)
            {
                loadRetryCount++;

                if (isAnyModeActive())
                {
                    start_motor();
                }

                loadState = LOAD_RETRY_RUN;
                loadTimer = now;
            }
            break;

        case LOAD_RETRY_RUN:
            if ((now - loadTimer) >= LOAD_RETRY_RUN_MS)
            {
                if (fault)
                {
                    stop_motor();
                    loadState = LOAD_FAULT_LOCK;
                    loadTimer = now;
                    Buzzer_TriggerAlert();
                }
                else
                {
                    loadState = LOAD_NORMAL;
                    loadRetryCount = 0;
                }
            }
            break;
    }
}

static uint8_t get_today_mask(void)
{
    uint8_t d = time.dow;
    if (d < 1 || d > 7) d = 1;
    return (1U << (d - 1));
}
static bool slot_is_active_now(const TimerSlot *t)
{
    if (!t->enabled)
        return false;

    if (!(t->dayMask & get_today_mask()))
        return false;

    uint16_t now = time.hour * 60 + time.min;
    uint16_t on  = t->onHour  * 60 + t->onMinute;
    uint16_t off = t->offHour * 60 + t->offMinute;

    /* If ON == OFF → treat as disabled */
    if (on == off)
        return false;

    /* Normal same-day slot */
    if (on < off)
        return (now >= on && now < off);

    /* Overnight slot */
    return (now >= on || now < off);
}


static bool timer_any_active_slot(void)
{
    for (int i = 0; i < 5; i++)
        if (slot_is_active_now(&timerSlots[i]))
            return true;
    return false;
}
static uint16_t get_active_timer_gap_minutes(void)
{
    if (!timerActive) return 0;

    uint16_t now = time.hour * 60 + time.min;
    uint8_t  dm  = get_today_mask();
    for (int i = 0; i < 5; i++)
    {
        TimerSlot *t = &timerSlots[i];
        if (!t->enabled || !(t->dayMask & dm)) continue;
        uint16_t on  = t->onHour * 60 + t->onMinute;
        uint16_t off = t->offHour * 60 + t->offMinute;
        bool active = (on < off) ?
                      (now >= on && now < off) :
                      (now >= on || now < off);
        if (active)
            return t->gapMinutes;
    }
    return 0;
}

void ModelHandle_SaveBuzzerSettings(void)
{
    EEPROM_WriteBuffer(EE_ADDR_BUZZER_BLOCK,
                       (uint8_t*)&buzzerSettings,
                       sizeof(buzzerSettings));
}
void ModelHandle_LoadBuzzerSettings(void)
{
    EEPROM_ReadBuffer(EE_ADDR_BUZZER_BLOCK,
                      (uint8_t*)&buzzerSettings,
                      sizeof(buzzerSettings));
}

void ModelHandle_ProcessTimerSlots(void)
{
    uint32_t now = HAL_GetTick();
    bool slotActive = timer_any_active_slot();

    /* ================= ENTER TIMER MODE ================= */
    if (!timerActive && slotActive)
    {
        backup_current_mode();

        clear_all_modes();      // clear first
        senseMaxRunReached = false;   // 🔥 ADD THIS
        timerActive = true;
        autoActive  = false;    // ensure auto disabled
        autoState   = AUTO_IDLE;

        motorOwner  = MOTOR_OWNER_TIMER;
        timerState  = TIMER_STATE_ON;
        timerStateDeadline = 0;
    }

    /* ================= EXIT TIMER MODE ================= */
    if (timerActive && !slotActive)
    {
        stop_motor();

        timerActive = false;
        timerState  = TIMER_STATE_ON;
        timerStateDeadline = 0;

        restore_previous_mode();
        ModelHandle_SaveModeState();
        return;
    }

    if (!timerActive)
        return;

    if (isTankFull() ||
        senseOverLoad ||
        senseUnderLoad ||
        senseOverUnderVolt ||
        senseMaxRunReached)
    {
        stop_motor();
        return;
    }

    uint16_t slotGap = get_active_timer_gap_minutes();
    uint16_t mainGap = sys.gap_time_s / 60;

    uint16_t appliedGapMin = (slotGap > 0) ? slotGap : mainGap;
    uint32_t gapMs = appliedGapMin * 60UL * 1000UL;

    if (gapMs == 0)
    {
        motorOwner = MOTOR_OWNER_TIMER;
        start_motor();
        return;
    }

    switch (timerState)
    {
        case TIMER_STATE_ON:
            if (timerStateDeadline == 0)
            {
                timerStateDeadline = now + gapMs;
                motorOwner = MOTOR_OWNER_TIMER;
                start_motor();
            }

            if (now >= timerStateDeadline)
            {
                stop_motor();
                timerState = TIMER_STATE_OFF;
                timerStateDeadline = now + gapMs;
            }
        break;

        case TIMER_STATE_OFF:
            if (now >= timerStateDeadline)
            {
                timerState = TIMER_STATE_ON;
                timerStateDeadline = 0;
            }
        break;

        default:
            timerState = TIMER_STATE_ON;
            timerStateDeadline = 0;
        break;
    }
}


void ModelHandle_StartTimer(void)
{
    ModelHandle_SaveTimerToEEPROM();
}

void ModelHandle_StopTimer(void)
{
    timerActive = false;
    timerStateDeadline = 0;   // ADD THIS
    stop_motor();
    ModelHandle_SaveModeState();
}

void ModelHandle_CheckAutoTimerActivation(void)
{
    if (timerActive) return;

