Amiya200/stm32_water_tank/Core/Src/model_handle.c
    if (timer_any_active_slot())
    {
        timerActive = true;
        start_motor();
    }
}
void ModelHandle_StartSemiAuto(void)
{
    restartActive = false;
    clear_all_modes();
    timerActive = false;
    autoActive  = false;
    semiAutoActive = true;
    motorOwner     = MOTOR_OWNER_SEMIAUTO;
    start_motor();
    ModelHandle_SaveModeState();
}

void ModelHandle_StopSemiAuto(void)
{
    semiAutoActive = false;
    stop_motor();
    ModelHandle_SaveModeState();
}

void ModelHandle_StartAuto(uint16_t gap_s,
                           uint16_t maxrun_min,
                           uint16_t retry)
{
    if (autoActive)
        return;

    clear_all_modes();

    autoActive       = true;
    autoBackgroundEnabled = true;
    auto_maxrun_min  = maxrun_min;
    auto_retry_limit = retry;
    auto_retry_count = 0;

    autoState = AUTO_ON_WAIT;

    uint32_t now = HAL_GetTick();

    uint32_t gap = (auto_gap_s == 0) ? 1 : auto_gap_s;


    autoRunStartMs = now;
    autoDeadline   = now + (gap * 1000UL);

    request_mode_switch(MOTOR_OWNER_AUTO);
}


void ModelHandle_StopAuto(void)
{
    stop_motor();

    autoActive = false;
    autoState  = AUTO_IDLE;
    auto_retry_count = 0;
    autoDeadline = 0;

    ModelHandle_SaveModeState();
}

void ModelHandle_LoadAutoSettings(void)
{
    EEPROM_ReadBuffer(0x0300, (uint8_t*)&auto_gap_s, sizeof(auto_gap_s));
    EEPROM_ReadBuffer(0x0302, (uint8_t*)&auto_maxrun_min, sizeof(auto_maxrun_min));
    EEPROM_ReadBuffer(0x0304, (uint8_t*)&auto_retry_limit, sizeof(auto_retry_limit));

    /* ===== VALIDATION ===== */

    if (auto_gap_s == 0xFFFF || auto_gap_s > 3600)
        auto_gap_s = 10;   // default 10 sec

    if (auto_maxrun_min == 0xFFFF || auto_maxrun_min > 600)
        auto_maxrun_min = 30;  // default 30 min

    if (auto_retry_limit == 0xFF || auto_retry_limit > 20)
        auto_retry_limit = 3;  // default 3 retry
}

static void auto_mode_background_control(void)
{
    if (!autoBackgroundEnabled)
        return;
    if (timerActive)
        return;
    uint32_t now = HAL_GetTick();
    if (now < bootBlockUntil)
        return;
    if (manualActive || semiAutoActive ||
        countdownActive || twistActive ||
        autoActive)
        return;
    uint8_t level = get_tank_level_percent();
    if (!autoActive &&
        level <= AUTO_START_LEVEL_PERCENT)
    {
        ModelHandle_StartAuto(
            auto_gap_s,
            auto_maxrun_min,
            auto_retry_limit
        );
    }
    if (autoActive &&
        level >= AUTO_STOP_LEVEL_PERCENT)
    {
        ModelHandle_StopAuto();
    }
}

uint32_t at = 0;
static void auto_tick(void)
{
    if (!autoActive)
        return;

    uint32_t now = HAL_GetTick();

    ModelHandle_CheckGroundWater();
    ModelHandle_CheckDryRun();

    bool protectionFault =
        senseOverLoad ||
        senseUnderLoad ||
        senseOverUnderVolt ||
        senseMaxRunReached;

    /* ================= HARD STOP ================= */
    if (isTankFull() || protectionFault)
    {
        ModelHandle_StopAuto();
        Buzzer_TriggerAlert();
        return;
    }

    /* Retry limit protection */
    if (auto_retry_limit > 0 &&
        auto_retry_count >= auto_retry_limit)
    {
        ModelHandle_StopAuto();
        Buzzer_TriggerAlert();
        return;
    }

    uint32_t gap = (auto_gap_s == 0) ? 1 : auto_gap_s;

    switch (autoState)
    {
        /* ================= ON STATE ================= */
        case AUTO_ON_WAIT:
        {
            motorOwner = MOTOR_OWNER_AUTO;
            start_motor();

            /* ================= WATER PRESENT ================= */
            if (senseDryRun == true)
            {
                auto_retry_count = 0;

                /* Reset gap timer continuously */
                autoDeadline = now + (gap * 1000UL);

                /* Max Run Protection */
                if (auto_maxrun_min > 0)
                {
                    uint32_t maxRunMs =
                        (uint32_t)auto_maxrun_min * 60000UL;

                    if ((now - autoRunStartMs) >= maxRunMs)
                    {
                        ModelHandle_StopAuto();
                        Buzzer_TriggerAlert();
                        return;
                    }
                }

                return;   // Continuous run
            }

            /* ================= DRY CONDITION ================= */

            /* Max Run Protection */
            if (auto_maxrun_min > 0)
            {
                uint32_t maxRunMs =
                    (uint32_t)auto_maxrun_min * 60000UL;

                if ((now - autoRunStartMs) >= maxRunMs)
                {
                    ModelHandle_StopAuto();
                    Buzzer_TriggerAlert();
                    return;
                }
            }

            /* ON duration expired → go OFF */
            if (now >= autoDeadline)
            {
                stop_motor();
                auto_retry_count++;

                autoDeadline = now + (gap * 1000UL);
                autoState    = AUTO_OFF_WAIT;
            }
        }
        break;

        /* ================= OFF STATE ================= */
        case AUTO_OFF_WAIT:
        {
            stop_motor();

            /* If water comes back while OFF → go ON immediately */
            if (senseDryRun == true)
            {
                auto_retry_count = 0;
                autoRunStartMs   = now;
                autoDeadline     = now + (gap * 1000UL);
                autoState        = AUTO_ON_WAIT;
                return;
            }

            /* Normal retry timing */
            if (now >= autoDeadline)
            {
                autoRunStartMs = now;
                autoDeadline   = now + (gap * 1000UL);
                autoState      = AUTO_ON_WAIT;
            }
        }
        break;

        default:
            autoState = AUTO_IDLE;
        break;
    }
}

void ModelHandle_StartCountdown(uint32_t seconds)
{
    if (seconds == 0)
        return;

    clear_all_modes();

    senseMaxRunReached = false;   // ✅ ADD THIS

    countdownActive   = true;
    countdownMode     = true;
    countdownDuration = seconds;
    cd_deadline       = now_ms() + seconds * 1000UL;

    motorOwner = MOTOR_OWNER_COUNTDOWN;
    start_motor();

    ModelHandle_SaveModeState();
}


void ModelHandle_StopCountdown(void)
{
    countdownActive = false;
    countdownMode   = false;
    countdownDuration = 0;
    SaveCountdown();
    stop_motor();
    ModelHandle_SaveModeState();
}
static void countdown_tick(void)
{
    if (!countdownActive)
        return;

    uint32_t now = now_ms();

    if (isTankFull() ||
        senseOverLoad ||
        senseUnderLoad ||
        senseOverUnderVolt ||
        senseMaxRunReached)
    {
        ModelHandle_StopCountdown();
        Buzzer_TriggerAlert();
        return;
    }

    if (now >= cd_deadline)
    {
        ModelHandle_StopCountdown();
        return;
    }

