Amiya200/stm32_water_tank/Core/Src/model_handle.c
    switch (motorOwner)
    {
        /* ================= RESTART ================= */
        case MOTOR_OWNER_RESTART:
        {
            if (isTankFull() || protectionFault)
            {
                ModelHandle_StopRestart();
            }
            else
            {
                start_motor();
            }
        }
        break;

        case MOTOR_OWNER_MANUAL:
        {
            if (protectionFault)
            {
                stop_motor();
            }
            else
            {
                start_motor();
            }
        }
        break;
        case MOTOR_OWNER_SEMIAUTO:
        {
            if (isTankFull() || protectionFault)
            {
                stop_motor();
            }
            else
            {
                start_motor();
            }
        }
        break;


        /* ================= TIMER ================= */
        case MOTOR_OWNER_TIMER:
        {
            /* Timer mode already controls motor internally */
            if (protectionFault || isTankFull())
                stop_motor();
        }
        break;

        /* ================= COUNTDOWN ================= */
        case MOTOR_OWNER_COUNTDOWN:
        {
            countdown_tick();

            if (isTankFull() || protectionFault)
            {
                ModelHandle_StopCountdown();
            }
        }
        break;

        /* ================= TWIST ================= */
        case MOTOR_OWNER_TWIST:
        {
            twist_tick();

            if (protectionFault)
                stop_motor();
        }
        break;

        /* ================= AUTO ================= */
        case MOTOR_OWNER_AUTO:
        {
            auto_tick();
        }
        break;

        /* ================= NONE ================= */
        case MOTOR_OWNER_NONE:
        default:
        {
            stop_motor();
        }
        break;
    }

    /* =========================================================
       6️⃣ AUTO BACKGROUND START LOGIC
       (Only when no strong owner active)
    ========================================================== */
    if (motorOwner == MOTOR_OWNER_NONE ||
        motorOwner == MOTOR_OWNER_AUTO)
    {
        auto_mode_background_control();
    }

    /* =========================================================
       7️⃣ UI UPDATE
    ========================================================== */
    leds_from_model();
    Buzzer_Update();
}

DryFSMState ModelHandle_GetDryState(void)
{
    return dryState;
}


void ModelHandle_ResetAll(void)
{
    clear_all_modes();
    stop_motor();
    senseDryRun        = false;
    senseOverLoad      = false;
    senseUnderLoad     = false;
    senseOverUnderVolt = false;
    senseMaxRunReached = false;
    countdownDuration = 0;
    UART_SendStatusPacket();
}
void ModelHandle_SetUserSettings(uint16_t gap_s,
                                 uint8_t  retry,
                                 uint16_t uv_limit,
                                 uint16_t ov_limit,
                                 int16_t  overload,
                                 int16_t  underload,
                                 uint16_t maxrun_min)
{
    sys.gap_time_s  = gap_s;
    sys.retry_count = retry;
    sys.uv_limit    = uv_limit;
    sys.ov_limit    = ov_limit;
    sys.overload  = (float)overload;
    sys.underload = (float)underload;
    sys.maxrun_min = maxrun_min;
    ModelHandle_SaveSettingsToEEPROM();
}
static uint8_t AUTO_CRC(const uint8_t* d, uint16_t l)
{
    uint8_t c = 0;
    while(l--) c ^= *d++;
    return c;
}

void ModelHandle_SetAutoSettings(uint16_t gap_s,
                                 uint16_t maxrun_min,
                                 uint8_t retry)
{
    auto_gap_s       = gap_s;
    auto_maxrun_min  = maxrun_min;
    auto_retry_limit = retry;
    EEPROM_WriteBuffer(0x0300, (uint8_t*)&auto_gap_s, sizeof(auto_gap_s));
    EEPROM_WriteBuffer(0x0302, (uint8_t*)&auto_maxrun_min, sizeof(auto_maxrun_min));
    EEPROM_WriteBuffer(0x0304, (uint8_t*)&auto_retry_limit, sizeof(auto_retry_limit));
}
bool ModelHandle_IsAutoActive(void)
{
    return autoActive;
}
void ModelHandle_SaveCurrentStateToEEPROM(void)
{
    RTC_PersistState s;
    memset(&s, 0, sizeof(s));

    if      (manualActive)    s.mode = 1;
    else if (semiAutoActive)  s.mode = 2;
    else if (timerActive)     s.mode = 3;
    else if (countdownActive) s.mode = 4;
    else if (twistActive)     s.mode = 5;
    else if (autoActive)      s.mode = 6;

    RTC_SavePersistentState(&s);
}
void ModelHandle_SetTimerSlot(uint8_t slot,
                              uint8_t onH, uint8_t onM,
                              uint8_t offH, uint8_t offM)
{
    timerSlots[slot].onHour    = onH;
    timerSlots[slot].onMinute  = onM;
    timerSlots[slot].offHour   = offH;
    timerSlots[slot].offMinute = offM;
    timerSlots[slot].enabled   = 1;
}

void ModelHandle_SetDryRun(bool on)
{
    sys.gap_time_s = on ? (sys.gap_time_s ? sys.gap_time_s : 10) : 0;
}
void ModelHandle_SetOverLoad(bool on)
{
    sys.overload = on ? (sys.overload > 0.1f ? sys.overload : 9.0f) : 0.0f;
}
void ModelHandle_SetOverUnderVolt(bool on)
{
    if (!on)
    {
        sys.uv_limit = 0;
        sys.ov_limit = 0;
    }
    else
    {
        if (!sys.uv_limit) sys.uv_limit = 190;
        if (!sys.ov_limit) sys.ov_limit = 270;
    }
}
void ModelHandle_ClearMaxRunFlag(void)
{
    senseMaxRunReached = false;
}
const TimerSlot* ModelHandle_GetTimerSlots(void)
{
    return timerSlots;
}
void ModelHandle_ProcessUartCommand(const char* cmd)
{
    (void)cmd;
}
bool ModelHandle_IsOverload(void)
{
    return senseOverLoad;
}
bool ModelHandle_IsUnderload(void)
{
    return senseUnderLoad;
}
bool ModelHandle_IsDryRunActive(void)
{
    return senseDryRun;
}
bool ModelHandle_IsVoltageFault(void)
{
    return senseOverUnderVolt;
}
bool ModelHandle_IsMaxRunReached(void)
{
    return senseMaxRunReached;
}

uint8_t ModelHandle_GetTankLevelPercent(void)
{
    return get_tank_level_percent();
}

bool ModelHandle_IsTankFull(void)
{
    return isTankFull();
}
bool ModelHandle_IsManualActive(void)
{
    return manualActive;
}
uint16_t ModelHandle_GetAutoGap(void)
{
    return auto_gap_s;
}

uint16_t ModelHandle_GetAutoMaxRun(void)
{
    return auto_maxrun_min;
}

uint8_t ModelHandle_GetAutoRetry(void)
{
    return auto_retry_limit;
}

